In [1]:
# Leave commented out unless you recieve and error that you do not have psycopg2 installed.

# import sys
# import subprocess

# try:
#    import psycopg2-
# except ImportError:
#     subprocess.check_call([sys.executable, "-m", "pip", "install", "--user", "psycopg2-binary"])
#     import psycopg2

# print(psycopg2.__version__)

In [2]:
import pandas as pd
from sqlalchemy import create_engine, text

In [3]:
database_name = 'prescribers'   

connection_string = f"postgresql://postgres:postgres@localhost:5432/{database_name}"

In [4]:
engine = create_engine(connection_string)

In [5]:

query = """

SELECT 
    * 
FROM 
    prescriber

"""

In [6]:
with engine.connect() as connection:
    result = connection.execute(text(query))
    prescriber = pd.DataFrame(result.fetchall(), columns=result.keys())

In [7]:
prescriber.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 25050 entries, 0 to 25049
Data columns (total 17 columns):
 #   Column                        Non-Null Count  Dtype
---  ------                        --------------  -----
 0   npi                           25050 non-null  object
 1   nppes_provider_last_org_name  25049 non-null  object
 2   nppes_provider_first_name     25050 non-null  object
 3   nppes_provider_mi             19245 non-null  object
 4   nppes_credentials             23827 non-null  object
 5   nppes_provider_gender         25050 non-null  object
 6   nppes_entity_code             25050 non-null  object
 7   nppes_provider_street1        25050 non-null  object
 8   nppes_provider_street2        9790 non-null   object
 9   nppes_provider_city           25050 non-null  object
 10  nppes_provider_zip5           25050 non-null  object
 11  nppes_provider_zip4           21568 non-null  object
 12  nppes_provider_state          25050 non-null  object
 13  nppes_provider_country        25050 non-null  object
 14  specialty_description         25050 non-null  object
 15  description_flag              25050 non-null  object
 16  medicare_prvdr_enroll_status  25050 non-null  object
dtypes: object(17)
memory usage: 3.2+ MB

In [8]:
prescriber.head()

,npi,nppes_provider_last_org_name,nppes_provider_first_name,nppes_provider_mi,nppes_credentials,nppes_provider_gender,nppes_entity_code,nppes_provider_street1,nppes_provider_street2,nppes_provider_city,nppes_provider_zip5,nppes_provider_zip4,nppes_provider_state,nppes_provider_country,specialty_description,description_flag,medicare_prvdr_enroll_status
0,1003000282,BLAKEMORE,ROSIE,K,FNP,F,I,TENNESSEE PRISON FOR WOMEN,3881 STEWARTS LANE,NASHVILLE,37243,0001,TN,US,Nurse Practitioner,S,N
1,1003012022,CUDZILO,COREY,None,M.D.,M,I,2240 SUTHERLAND AVE,SUITE 103,KNOXVILLE,37919,2333,TN,US,Pulmonary Disease,S,E
2,1003013160,GRABENSTEIN,WILLIAM,P,M.D.,M,I,1822 MEMORIAL DR,None,CLARKSVILLE,37043,4605,TN,US,Family Practice,S,E
3,1003013947,OTTO,ROBERT,J,M.D.,M,I,2400 PATTERSON STREET SUITE 100,None,NASHVILLE,37203,2786,TN,US,Orthopedic Surgery,S,E
4,1003017963,TODD,JOSHUA,W,M.D.,M,I,1819 W CLINCH AVE,SUITE 108,KNOXVILLE,37916,2435,TN,US,Cardiology,S,E

In [11]:
# Bring SQL notebook in to Python


query3 = """

SELECT 
	d.drug_name,
	fc.state,
	fc.county,
	SUM(rx.total_claim_count) AS total_count,
	pop.population
FROM drug d
JOIN prescription rx
	USING (drug_name)
JOIN prescriber p
	USING (npi)
JOIN zip_fips zf
	ON p.nppes_provider_zip5 = zf.zip
JOIN population pop
	USING (fipscounty)
JOIN fips_county fc
	USING (fipscounty)
WHERE d.opioid_drug_flag = 'Y'
	AND p.nppes_provider_state = 'TN'
GROUP BY fc.county, fc.state, d.drug_name, pop.population
ORDER BY fc.county, d.drug_name
 
"""
with engine.connect() as connection:
    result = connection.execute(text(query3))
    opioid_county = pd.DataFrame(result.fetchall(), columns=result.keys())

opioid_county

                           drug_name state    county total_count population
0              ACETAMINOPHEN-CODEINE    TN  ANDERSON         889      75538
1     BUTALB-CAFF-ACETAMINOPH-CODEIN    TN  ANDERSON          13      75538
2        BUTALBITAL COMPOUND-CODEINE    TN  ANDERSON          13      75538
3               BUTORPHANOL TARTRATE    TN  ANDERSON          12      75538
4                            BUTRANS    TN  ANDERSON          12      75538
...                              ...   ...       ...         ...        ...
2051              OXYMORPHONE HCL ER    TN    WILSON         288     128874
2052                    TRAMADOL HCL    TN    WILSON        7592     128874
2053      TRAMADOL HCL-ACETAMINOPHEN    TN    WILSON          60     128874
2054                 TRAMADOL HCL ER    TN    WILSON          73     128874
2055                      ZOHYDRO ER    TN    WILSON          15     128874

[2056 rows x 5 columns]

In [12]:
opioid_county['total_count'] = opioid_county['total_count'].astype(float)
opioid_county['population'] = opioid_county['population'].astype(float)
opioid_county.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2056 entries, 0 to 2055
Data columns (total 5 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   drug_name    2056 non-null   object
 1   state        2056 non-null   object
 2   county       2056 non-null   object
 3   total_count  2056 non-null   float64
 4   population   2056 non-null   float64
dtypes: float64(2), object(3)
memory usage: 80.4+ KB

In [17]:
county_summary_df = ( 
    opioid_county 
    .groupby(['county', 'population'])['total_count'] 
    .sum() 
    .reset_index() 
)
county_summary_df

        county  population  total_count
0     ANDERSON     75538.0      52701.0
1      BEDFORD     46854.0      41506.0
2       BENTON     16154.0      12046.0
3      BLEDSOE     14413.0      22145.0
4       BLOUNT    127135.0      62747.0
..         ...         ...          ...
90       WAYNE     16713.0      22481.0
91     WEAKLEY     33776.0      67839.0
92       WHITE     26394.0       9829.0
93  WILLIAMSON    212161.0     104875.0
94      WILSON    128874.0      65860.0

[95 rows x 3 columns]

In [23]:
county_summary_df["high_opioid_counties"] = county_summary_df["total_count"] / county_summary_df["population"]
county_summary_df = county_summary_df.sort_values(by="high_opioid_counties", ascending=False)
county_summary_df.head(10)

       county  population  total_count  high_opioid_counties
63      MOORE      6302.0      44689.0              7.091241
43    JACKSON     11573.0      60726.0              5.247213
87  VAN BUREN      5675.0      23578.0              4.154714
84  TROUSDALE      8773.0      29060.0              3.312436
66    OVERTON     21995.0      63335.0              2.879518
8     CARROLL     28137.0      78063.0              2.774390
68    PICKETT      5071.0      12914.0              2.546638
33    HANCOCK      6605.0      15952.0              2.415140
37    HAYWOOD     17944.0      41046.0              2.287450
79      SMITH     19279.0      39822.0              2.065564